In [1]:
import pandas as pd

In [8]:
d1 = {'name': ['半沢','大和田','中野渡'], 'code': ['101', '102', '104']}
d2 = {'code': ['101', '102', '103'], 'place': ['東京','大阪','名古屋']}
df1 = pd.DataFrame(data=d1)
df2 = pd.DataFrame(data=d2, index=[1,2,3])

In [9]:
df1

  name code
0   半沢  101
1  大和田  102
2  中野渡  104

In [10]:
df2

  code place
1  101    東京
2  102    大阪
3  103   名古屋

In [14]:
df3, df4 = df1.align(df2, join='inner', axis=1)

In [15]:
df3

  code
0  101
1  102
2  104

In [16]:
df4

  code
1  101
2  102
3  103

## 内部結合（join="inner"）は2つのDataFrameで一致する部分を表示する
## axis=1とすると一致する列が抽出される